## Importando **Pandas** and **numPy**

In [1]:
import numpy as np
import pandas as pd

In [2]:
my_dict = {
    
    'Colum ': [1, 2 , 3, np.nan],
    
    'Colum 2': [4, np.nan, 6, 7],
    
    'Colum 3': ['a', 'b', 'c', None]
 
 
 }

In [3]:
df = pd.DataFrame(my_dict, index=[1, 2, 3, 4 ])

In [4]:
df

   Colum   Colum 2 Colum 3
1     1.0      4.0       a
2     2.0      NaN       b
3     3.0      6.0       c
4     NaN      7.0    None

## Valores nulos

In [5]:
df.isnull()

   Colum   Colum 2  Colum 3
1   False    False    False
2   False     True    False
3   False    False    False
4    True    False     True

In [6]:
df.isnull()*1

   Colum   Colum 2  Colum 3
1       0        0        0
2       0        1        0
3       0        0        0
4       1        0        1

In [7]:
df.fillna("Misisgin")

     Colum    Colum 2   Colum 3
1       1.0       4.0         a
2       2.0  Misisgin         b
3       3.0       6.0         c
4  Misisgin       7.0  Misisgin

In [8]:
df.fillna(df.mean())

/tmp/ipykernel_45712/634187881.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.fillna(df.mean())

   Colum    Colum 2 Colum 3
1     1.0  4.000000       a
2     2.0  5.666667       b
3     3.0  6.000000       c
4     2.0  7.000000    None

## **Interpolate():** rellenar valores que llevan un orden

In [13]:
df.interpolate(axis=0, limit=9, )

   Colum   Colum 2 Colum 3
1     1.0      4.0       a
2     2.0      5.0       b
3     3.0      6.0       c
4     3.0      7.0    None

## **dropna():** Borrar valores nulos

In [10]:
df.dropna()

   Colum   Colum 2 Colum 3
1     1.0      4.0       a
3     3.0      6.0       c

In [11]:
df.droplevel()

TypeError: NDFrame.droplevel() missing 1 required positional argument: 'level'

In [ ]:
df.dropna(subset=['Colum 3', 'Colum 2'])

   Colum   Colum 2 Colum 3
1     1.0      4.0       a
3     3.0      6.0       c

In [ ]:
df

   Colum   Colum 2 Colum 3
1     1.0      4.0       a
2     2.0      NaN       b
3     3.0      6.0       c
4     NaN      7.0    None

In [ ]:
df.dropna(thresh=3)

   Colum   Colum 2 Colum 3
1     1.0      4.0       a
3     3.0      6.0       c